# თქვენი სიტყვებით აღწერეთ დეტალურად , რას ნიშნავს input და output ,  როგორ ვიყენებთ მას პროგრამირებაში  კერძოდ პითონში, მოიყვანეთ მინიმუმ 5 მაგალითი , ასევე ისაუბრეთ input & output მოწყობილობებზე

# Input არის ინფორმაცია, რომელსაც პროგრამა იღებს მომხმარებლისგან ან სხვა წყაროდან, რათა იმუშაოს ამ მონაცემებზე. მაგალითად, როდესაც მომხმარებელი შ Enter-ით ტექსტს შეიყვანს პროგრამაში, ეს არის Input.
name = input("საბა")

# Output არის ინფორმაცია, რომელსაც პროგრამა აბრუნებს ან აჩვენებს მომხმარებელს. მაგალითად, ეკრანზე შეტყობინების დაბეჭდვა.
print("გამარჯობა,", name)

# პითონში Input-ისთვის ვიყენებთ input() ფუნქციას — ის იღებს მომხმარებლის შეყვანას ტექსტის სახით (string-ის სახით)

# მაგალითები
name = input("საბა")
print("გამარჯობა,", name)

num1 = (input("30"))
num2 = (input("27"))
sum = num1 + num2
print("ორივე რიცხვის ჯამი არის:", sum)

celsius = (input("20"))
fahrenheit = (celsius * 9/5) + 32
print("ტემპერატურა ფარენჰაიტში:", fahrenheit)

number = (input("10"))
if number % 2 == 5:
 print("10")
else:
 print("5")

# Input ფაილიდან
with open("input.txt", "r") as file:
 data = file.read()

# Output ფაილში
with open("output.txt", "w") as file:
 file.write("მონაცემები: " + data)

# Input მოწყობილობები (შეყვანის მოწყობილობები)
# კლავიატურა — ტექსტის შეყვანა
# მაუსი — პოზიციის არჩევა და კლიკები
# მიკროფონი — ხმის შეყვანა
# კამერა — სურათისა და ვიდეოს მიღება
# სკანერი — დოკუმენტების ციფრულ ფორმატში გადაყვანა
# სენსორები — გარემოდან მონაცემების შეგროვება


# Output მოწყობილობები (გამოყვანის მოწყობილობები)
# მონიტორი — გამოსახულების ჩვენება ეკრანზე
# პრინტერი — ტექსტისა და გამოსახულების ქაღალდზე დაბეჭდვა
# სპიკერი — ხმის გაჟღერება
# პროექტორი — გამოსახულების პროეცირება ეკრანზე ან კედელზე

