# 1)ჩამოწერეთ ფუნქციები რომლებსაც ვიყენებთ data conversion(მონაცემების ტიპის შეცვლა)-ის თვის და თითოეულს მიუწერეთ აღწერა


# 1 გამოიყენება სხვა ტიპის მნიშვნელობის მთელი რიცხვად (integer) გარდასაქმნელად
x = int(3.9)      # გადაიქცევა 3-ად
y = int("10")     # გადაიქცევა 10-ად

# 2 გარდაქმნის მნიშვნელობას ათწილადად (floating point)
x = float(5)        # გახდება 5.0
y = float("3.14")   # გახდება 3.14

# 3 გარდაქმნის ნებისმიერ მნიშვნელობას ტექსტად (string)
x = str(100)        # გახდება "100"
y = str(3.14)       # გახდება "3.14"

# 4 გარდაქმნის მნიშვნელობას True ან False მნიშვნელობად
x = bool(1)         # True
y = bool(0)         # False
z = bool("")        # False
k = bool("hello")   # True

# 5 გარდაქმნის ელემენტებს სიად (list)
x = list("abc")     # (a,b,c)
